src/Documents/ПереоценкаВалютныхСчетов/ПереоценкаВалютныхСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереоценкаВалютныхСчетов</name>
  <registerRecords>AccountingRegister.РегистрБухгалтерии</registerRecords>
</mdclass:Document>

src/AccountingRegisters/РегистрБухгалтерии/РегистрБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрБухгалтерии</name>
  <chartOfAccounts>ChartOfAccounts.ПланСчетов</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.ЮрЛица</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.ПланСчетов.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>УпрСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.ПланСчетов.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/ChartsOfAccounts/ПланСчетов/ПланСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланСчетов</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>01</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>01.1</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>01.2</code>
      </childItems>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары</description>
        <code>01.5</code>
      </childItems>
      <childItems>
        <name>КассаВВалюте</name>
        <description>Касса в валюте</description>
        <code>01.11</code>
      </childItems>
    </items>
    <items>
      <name>Пассивы</name>
      <description>Пассивы</description>
      <code>02</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Прибыль</name>
        <description>Прибыль</description>
        <code>02.1</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Взаиморасчеты</name>
      <description>Взаиморасчеты</description>
      <code>03</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>03.1</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>03.2</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/Documents/ПереоценкаВалютныхСчетов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрБухгалтерииОстатки.Счет КАК Счет,
	|	РегистрБухгалтерииОстатки.Субконто1 КАК Субконто1,
	|	РегистрБухгалтерииОстатки.Субконто2 КАК Субконто2,
	|	РегистрБухгалтерииОстатки.Валюта КАК Валюта,
	|	РегистрБухгалтерииОстатки.ВалСуммаОстаток * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) - РегистрБухгалтерииОстатки.СуммаОстаток КАК Отклонение,
	|	РегистрБухгалтерииОстатки.Счет.Вид КАК СчетВид,
	|	РегистрБухгалтерииОстатки.Счет.ВидыСубконто.(
	|		НомерСтроки КАК СчетНомерСтроки,
	|		ВидСубконто КАК СчетВидСубконто
	|	) КАК ВидыСубконто
	|ИЗ
	|	РегистрБухгалтерии.РегистрБухгалтерии.Остатки(&МоментВремени, Счет.Валютный, , ) КАК РегистрБухгалтерииОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютСрезПоследних
	|		ПО РегистрБухгалтерииОстатки.Валюта = КурсыВалютСрезПоследних.Валюта
	|ГДЕ
	|	(ВЫРАЗИТЬ(РегистрБухгалтерииОстатки.ВалСуммаОстаток * ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 1) - РегистрБухгалтерииОстатки.СуммаОстаток КАК ЧИСЛО(15, 2))) <> 0";
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени() );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		                                 
		Проводка = Движения.РегистрБухгалтерии.Добавить();
		Проводка.Период = Дата;
		//Отклонение = Окр(Выборка.отклонение,2);
		Если (Выборка.Отклонение > 0 И Выборка.СчетВид <> ВидСчета.Пассивный) ИЛИ
			 (Выборка.Отклонение < 0 И Выборка.СчетВид = ВидСчета.Пассивный) Тогда
			//Хорошо!
			Проводка.СчетКт = ПланыСчетов.ПланСчетов.Прибыль; 
			Проводка.СчетДт = Выборка.Счет;
			Проводка.ВалютаДт = Выборка.Валюта;
			
			ВыборкаСубконто = Выборка.ВидыСубконто.Выбрать();
			Пока ВыборкаСубконто.Следующий() Цикл
				Проводка.СубконтоДт[ВыборкаСубконто.СчетВидСубконто]= Выборка["Субконто" + ВыборкаСубконто.СчетНомерСтроки] ; 
			КонецЦикла; 
						
		Иначе
			//Плохо!
			Проводка.СчетДт = ПланыСчетов.ПланСчетов.Прибыль;
			Проводка.СчетКт = Выборка.Счет;
			Проводка.ВалютаКт = Выборка.Валюта;
			ВыборкаСубконто = Выборка.ВидыСубконто.Выбрать();
			Пока ВыборкаСубконто.Следующий() Цикл
				Проводка.СубконтоКт[ВыборкаСубконто.СчетВидСубконто]= Выборка["Субконто" + ВыборкаСубконто.СчетНомерСтроки] ; 
			КонецЦикла; 
		КонецЕсли; 
		
		Проводка.Сумма = МАКС(Выборка.Отклонение, - Выборка.Отклонение);
		Проводка.СодержаниеПроводки = "Переоценка валюты";
		
	КонецЦикла; 
	Движения.РегистрБухгалтерии.Записывать = Истина;

КонецПроцедуры
